# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
data1 = np.random.randint(1, 4, size=100)
data2 = np.random.randint(1, 3, size=100)
data3 = np.random.randint(10000, 30000, size=100)

In [3]:
data1

array([1, 3, 3, 2, 3, 1, 1, 2, 3, 1, 3, 1, 2, 3, 1, 1, 3, 3, 2, 1, 1, 1,
       2, 2, 1, 3, 3, 1, 1, 2, 1, 1, 3, 3, 2, 2, 3, 3, 2, 3, 1, 1, 2, 1,
       1, 2, 1, 3, 1, 1, 2, 3, 2, 1, 2, 3, 1, 1, 2, 1, 2, 2, 3, 3, 1, 3,
       3, 3, 2, 2, 3, 1, 2, 3, 2, 3, 2, 2, 1, 3, 2, 2, 1, 3, 1, 1, 2, 3,
       3, 2, 2, 1, 3, 3, 1, 3, 2, 1, 3, 1])

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
fictious_data = pd.DataFrame({'0':data1, '1':data2, '2':data3})
fictious_data.head()

   0  1      2
0  1  2  16342
1  3  1  16874
2  3  1  20211
3  2  2  15360
4  3  1  19243

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [5]:
fictious_data.rename(columns={'0':'bedrs', '1':'bathrs', '2':'price_sqr_meter'}, inplace=True)
fictious_data.head()

   bedrs  bathrs  price_sqr_meter
0      1       2            16342
1      3       1            16874
2      3       1            20211
3      2       2            15360
4      3       1            19243

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [6]:
data11 = pd.DataFrame(data=data1)
data12 = pd.DataFrame(data=data2)
data13 = pd.DataFrame(data=data3)

In [7]:
bigcolumn = pd.concat([data11, data12, data13], axis=0)
bigcolumn = pd.DataFrame(bigcolumn)
bigcolumn

        0
0       1
1       3
2       3
3       2
4       3
..    ...
95  14336
96  16965
97  12105
98  25963
99  25461

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [8]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [10]:
bigcolumn.set_index(keys=np.arange(len(bigcolumn)), inplace=True)
bigcolumn

         0
0        1
1        3
2        3
3        2
4        3
..     ...
295  14336
296  16965
297  12105
298  25963
299  25461

[300 rows x 1 columns]

In [58]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        1
1        1
2        1
3        3
4        3
..     ...
295  21936
296  24476
297  17470
298  15587
299  28139

[300 rows x 1 columns]